// SPDX-License-Identifier: GPL-3.0

pragma solidity ^0.8.0;

abstract contract LibL11ST {
    address private azathoth;
    bool sleepStatus;

    constructor(address azathothOverride, bool sleep) {
        azathoth = azathothOverride == address(0) ? msg.sender : azathothOverride;
        sleepStatus = sleep;
    }

    modifier isAzathoth() {
        if (azathoth != msg.sender) {
            sleepStatus = true;
            revert(unicode"B̵̧̯͓͚͙͖́̇͆̌̌̆̉͘͘͝͝y̴̧̙͉̹͖͉̤̯̲̮̬͙͊͌̆̔̇̇̆̒ ̸̞̰̖̓ͅỹ̶̬̟̀̃̐͐͒͒ô̷̢̗͓͉̱̯̦̱͉͙̳̲̖̟͔͓̇͌͆͒u̵̡̧̺͇̗̿̚ŗ̴̝͍̣͎̺͓͎͓̼̯̘̘̜̙̪̀̓̌͂̈́͊͌̍̏͌͛͂͑̕̚ͅ ̸̛̰̀͑̑͊͒̽̈͠͝c̴̢̢̡̧̙͕̫̺͔͉̠̰̑͂̎̋ã̷͔̞̍̈́̽͐̓͛͛̈̆͠r̸̥̳̃͗̋̓̃ȩ̵̤̠̘͙̪͖̱͌ḽ̸̛̤̖̤̜͇̼̠̼̠̖̬̹̥̣͗͆e̶͔̱͈̹͔̤̻̦͖̞̍̏̀͑͑̒̂̈̀̆̑́̚͝ş̵̨̨̣͈̗͉̭̬̖̲̻̱͙̰͓͌͋͊̎̉̾̔͌̐͋͘ş̴̪̩̯͂̆̇͒̽̒̈̏͝ ̷̼̖̳̘͐̀͗̿͜i̷̥̫̣͎̇͆̀n̷̩̼͓̹͖͓͖̠͗̂̒̃̔̓̐̋͜t̷̬̺̯̖̞̲͔͚͛̈̃̃̏̈̒͋̄̒̑̚͘͠ͅe̷̡̢̧̺̤̪̭̖͍͓̻̺̼͚̪͂̀̄͌͗͊̍̅͜ṙ̸̦̜͙̦̟͙͙̖̏̌̒̉͋͐̓͘̚͝v̴͕̝̩̿͋̉̈̐̋́̍͒͌̔̓̐͒͝͝͠é̴̢̢̜̰̲̱͇̘̩́̂̃̾́̈́͌̈̌̃̑̊͆̚͘ņ̴̢͎̩̮̰̪̪͚̖̦͕͍̞̗̒͜͜ť̷̢͙̱͍̖̙̘̰̟̹̉͆͝i̵̡͖͂͊͑͊̈́̆̆̐̌͘̕o̵͓͓͎̱͉̤̗̺̜̟̲̩̗͂́͒̈́̐̏̌̒̐͌͐̍̓ņ̵̜̙̱̝͈̘̪̬̟͖̟͎͐͑̔̋͊͛̈́̀̕̚ ̶̭̩̩̼̼̙̄̈͑̐̽̓̒̔́̏̽͘͜ͅy̵̢̛̖̠͖͓͍̪͇̒̎̂̉̿͝o̷͈͇̺̫̫̣͑̾͐̏̓͐̽̈́̄̊̚ǘ̷͕̦̼̄̏̾̏́̂̾̅̋̈́̌́̓͒̈͜ ̴̢̪̫̣̦̳̘̗͔͙̙̗͇͌̽́͂̏͗̍̃̈̃͐͘å̸̢͔̠̣̺͓̹̘͖͖͎͉͖̊͝w̴̨̧̢̡̢͈͕͙̺͇̜̹͖̥̹̪̦͌̋͒̽̏͌̿̄̔̄̾̍̈ą̷̯̱͔̦̞̗͇͖̉͛̌̅̂k̷̪͇͎̤̫̘̳̩̙̳͋͂̋̿̔̓̍̉̑̌́̐̊̉͠͠͠é̵̹͙̭̥̫̮̈̏̅͌͜͠n̵̛̪͉̤̱͈͖̻̭̤̞̈̋̐͋͗͑̇̐̀̃̉̈́̌̂e̸̢̠͇̺͕̖̥̺̝̘̾͐̉̉͋̓̐͆́͌̎d̸̖̲̭͌́͛̎̐͋̈́̓͠͠͝ ̴̢̨͚̫̝̹̱͖͚͓̦͕̪̠̬̺̔͌ͅȀ̴̞̳̤͇̱̩̣͖̝͈͎̽̓̐̽̈̓̿̈́͆̽͘͝͝͠ͅͅz̶̼̘̖̩̰̱̦͓̗̗̕a̸̲̼̣͉̋͛̈́̽̋̌͂̾͗̆͐̏t̸̢̨̨̝̩̣̜͔̳̠̣͎̅́͒̐̓́͜͠͝h̵̼̰̟̥̖͕̅̒̆́̓̂̇̽̑̌̑͆̏̌͝o̷͕̩̎̋͝͝t̵̨͓̗̩̙̮̱͙̦̹̂̊͂́͐͌̌̔̎́̌̃̃̅̚̚h̸̙̥͍͚̩̼̙͎̊̉̃̏̀͒̏̇̀̎̾͗͊̓͠");
        }
        _;
    }

    function getAddress() public isAzathoth returns(address) {
        return azathoth;
    }

    function getSleepStatus() public view returns(string memory) {
        return sleepStatus ? "Azathoth is still sleeping" : unicode"H̸̠͔͖̲̯̻̘̹̜̘̔̾́͌̃́̌̏̊̍̃͋́͒̚͜͠e̸̩̻̯̪̣̮̟͕̳̮̯͆͌ ̸̥̄͛̐̊̿w̷̮̙̮̝̗̮͋̄̾̄̓͐̀͂͋͆͛o̴̧̝͚̤̬̲̻̟͊̊̇̅̇̑͐̅̀̅́̃́͘͠͠͝ͅk̸̢̡̥̠̟̪̱̲͎̮̲̐̀͊̀͂́̈́̉̀̎̉̅͝͝ȅ̶̻̼̘̦̻̉̅̎̈́̉̏͑̑̑̑̒̑̉͝͝ ̸̧̤̮̝̝̱̗̤̟̭̠͓̥͍̱͚̏̒̈͑̿͊͆̑̕͘ͅử̵͇̤͙͉̤͈̯͌͗̎̌͗̊͊͑̔̂̍̒͝͝p̸̫͌̈́̌̀͛̓̀͒́́̀̏͛̒͝͠";
    } 
}

contract L11ST is LibL11ST {
    constructor() LibL11ST(msg.sender, true) {
    }

    function awaken() public returns(string memory) {
        require(sleepStatus, unicode"Ḩ̷̢̙͕̯̼̠̪̭͙̜̤̭̰̪̇̀̍̈́̀͛̿̾̀͘͝ȩ̴̧͖͔̭͕̥̠̳͓̖͚̱̙̔̂͒͠ͅ ̵̨̢̛̟͇̪̺̞͓͋̓̾͆̀̔̈́̈́̕͘͠͝į̶̪̪̩͎͌͜ͅṡ̵̨̡͕͉̥͈͓̲̹̯͓̮̪̩̎̾̽͋͒̈́͋͝ ̷͔̬́̿a̸͕͙̠͒̈̀̓̓̅͘̕͘l̴̡̨͕̝̠͔͓̖̤̣̓̒̀͋ͅͅŗ̶̧̝̤͇̙̝̲͖̣͓̭̃̄̇͐̇͛͋͌̒̆́͠͝͠e̴̡͍̲͕̰̝̼̞̳̩̜̊͂̏͋̚͝͠a̵̡̨̯̥̝͙̟̳̙̎ͅd̷̢̡̢̳͔͚̭̹̫̤͓̺̺͒͂͘ȳ̴̢̪̮̺̬͙̝̻͚̜͈̤̱͊̉͐̐͂̆͐͛̎̚̚͘͠͝͠ ̴̙͔͙̻̭̠̯̒̾̅́͌̒ą̴̢̧̧̝̮̬̖̻̯̤̞̭̘̙̗̲͐̾̐̌̆͋́̄̾̂̅̂̿͐̕̕͘ẃ̸̧̹̝̤͉͉̼͇̼̫̂̎̿͑̑̒̆͆͆͘á̶͚̉̌́̌͗k̶̬̯͎̫̦̲̹̅̆̿̉̒̔̆͌̂̊̚͜ê̴̛̛̦̮͗͐͑̕̚n̷̨̢̨̡̠̥͓̭͉̗͚̩̮̳͓̯̄̎̌̅̽́̈́e̴̢̢̡̪͙̩̳͚͍̮̖̤͈̠͇͓͈̾̇͛̎̓̂̀̃͌̓͝d̴̛͙̄̏̈́̎̿͜");
        sleepStatus = false;

        return unicode"A̶͚̫̲͈̩͔͔͒̏͆͋͆̋̏͐̅̋̑̌͘w̴̩̮̼͇͓̓̏̈́͋̇͑̔͘̕͠͝ȁ̵̢̗͈͈̟͔̜̫̖̭͇͙͓͉̦̐͆̒͂ͅk̵̡͈͕̼͎͊̀̓̇͑̈́̏̉̐̔̀̎̚e̷̻̻̰̿͋n̵͕̬̼̣̖͚̲͎̹͙͓͑̒e̵̡̛̥͇͕͎͍̽̃͛̔͆́̉̒͒̒͌͛͠͝d̶̳̼̮̿̽̆̆́̊̊́̈́͘͠";
    }
}